---
kind: property
id: P:Autodesk.Revit.DB.FamilyInstance.ExtensionUtility
zh: 族实例
source: html/2ff87911-3c17-babc-781d-e2c68e62d4e9.htm
---
# Autodesk.Revit.DB.FamilyInstance.ExtensionUtility Property

**中文**: 族实例

Property to check whether the instance can be extended and return the interface for extension operation.

## Syntax (C#)
```csharp
public IExtension ExtensionUtility { get; }
```

## Remarks
If the family instance can not support extension operation, it returns Nothing nullptr a null reference ( Nothing in Visual Basic)